In [12]:
"""
    In this module, I learnt how to create a pandas dataframe from a python dictionary ðŸ“™
"""

'\n    In this module, I learnt how to create a pandas dataframe from a python dictionary ðŸ“™\n'

In [13]:
import pandas as pd

In [14]:
students = {
    'StudentID': ['1001', '1002', '1003', '1004', '1005', '1006', '1007', '1008', '1009', '1010'],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank', 'Grace', 'Henry', 'Isabel', 'John'],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'Age': [18, 17, 18, 17, 16, 18, 16, 17, 18, 16],
    'Math': [95, 85, 92, 78, 88, 90, 85, 90, 92, 85],
    'Computer Science': [87, 78, 80, 85, 75, 82, 90, 88, 80, 75],
    'Sciences': [90, 85, 95, 80, 82, 92, 88, 85, 90, 95],
    'English': [95, 88, 92, 85, 90, 82, 88, 85, 80, 92],
    'GPA': [3.89, 2.99, 3.89, 3.09, 3.31, 3.51, 3.38, 3.28, 3.02, 3.73]
}

In [15]:
Students_df = pd.DataFrame(students)

In [16]:
Students_df

,StudentID,Name,Gender,Age,Math,Computer Science,Sciences,English,GPA
0,1001,Alice,Female,18,95,87,90,95,3.89
1,1002,Bob,Male,17,85,78,85,88,2.99
2,1003,Charlie,Male,18,92,80,95,92,3.89
3,1004,David,Male,17,78,85,80,85,3.09
4,1005,Emily,Female,16,88,75,82,90,3.31
5,1006,Frank,Male,18,90,82,92,82,3.51
6,1007,Grace,Female,16,85,90,88,88,3.38
7,1008,Henry,Male,17,90,88,85,85,3.28
8,1009,Isabel,Female,18,92,80,90,80,3.02
9,1010,John,Male,16,85,75,95,92,3.73

In [17]:
type(Students_df)

pandas.core.frame.DataFrame

In [18]:
list(Students_df.shape)[0]

10

In [19]:
Students_df.count()

StudentID           10
Name                10
Gender              10
Age                 10
Math                10
Computer Science    10
Sciences            10
English             10
GPA                 10
dtype: int64

In [20]:
Students_df[['Name', 'GPA']]

      Name   GPA
0    Alice  3.89
1      Bob  2.99
2  Charlie  3.89
3    David  3.09
4    Emily  3.31
5    Frank  3.51
6    Grace  3.38
7    Henry  3.28
8   Isabel  3.02
9     John  3.73

In [21]:
Students_df.columns

Index(['StudentID', 'Name', 'Gender', 'Age', 'Math', 'Computer Science',
       'Sciences', 'English', 'GPA'],
      dtype='object')

# Pandas `loc` vs. `iloc`
In pandas, loc and iloc are two methods used for selecting data from a DataFrame. The key difference between them is in how they reference the data.

# `loc`
loc is used for label-based indexing, where you specify the row and column labels to select the data. You can use either single labels or lists of labels to select one or more rows or columns. For example:

In [22]:
print(Students_df.loc[3, 'Name'])  # selects the value at row 3 and column 'column_name'
Students_df.loc[[1, 2, 3], ['Name', 'GPA']]  # selects rows 1, 2, and 3 for columns 'col1' and 'col2'

David

      Name   GPA
1      Bob  2.99
2  Charlie  3.89
3    David  3.09

# iloc
`iloc`, on the other hand, is used for integer-based indexing, where you specify the row and column numbers to select the data. You can also use either single integers or lists of integers to select one or more rows or columns. For example:

In [23]:
print(Students_df.iloc[3, 1])  # selects the value at row 3 and column 1
Students_df.iloc[[1, 2, 3], [0, 1]]  # selects rows 1, 2, and 3 for columns 0 and 1

David

  StudentID     Name
1      1002      Bob
2      1003  Charlie
3      1004    David

In summary, `loc` is used for label-based indexing, while `iloc` is used for integer-based indexing. Which one to use depends on how the data is labeled or numbered. If the data has a labeled index, you should use `loc`, while if it has a numbered index, you should use `iloc`.
So, basically the format both `loc` and `iloc` is `[row(s), column(s)]`